Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.41/samv71b/atdf/ATSAMV71N20B.atdf
        <register caption="Interrupt Mask Register" name="QSPI_IMR" offset="0x1C" rw="R" size="4" atomic-op="read:QSPI_IMR">
          <bitfield caption="Receive Data Register Full Interrupt Mask" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty Interrupt Mask" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Transmission Registers Empty Mask" mask="0x00000004" name="TXEMPTY"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000008" name="OVRES"/>
          <bitfield caption="Chip Select Rise Interrupt Mask" mask="0x00000100" name="CSR"/>
          <bitfield caption="Chip Select Status Interrupt Mask" mask="0x00000200" name="CSS"/>
          <bitfield caption="Instruction End Interrupt Mask" mask="0x00000400" name="INSTRE"/>
        </register>
        <register caption="Serial Clock Register" name="QSPI_SCR" offset="0x20" rw="RW" size="4">
          <bitfield caption="Clock Polarity" mask="0x00000001" name="CPOL"/>
          <bitfield caption="Clock Phase" mask="0x00000002" name="CPHA"/>
          <bitfield caption="Serial Clock Baud Rate" mask="0x0000FF00" name="SCBR"/>
          <bitfield caption="Delay Before QSCK" mask="0x00FF0000" name="DLYBS"/>
        </register>
        <register caption="Instruction Address Register" name="QSPI_IAR" offset="0x30" rw="RW" size="4">
          <bitfield caption="Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Instruction Code Register" name="QSPI_ICR" offset="0x34" rw="RW" size="4">
          <bitfield caption="Instruction Code" mask="0x000000FF" name="INST"/>
          <bitfield caption="Option Code" mask="0x00FF0000" name="OPT"/>
        </register>
        <register caption="Instruction Frame Register" name="QSPI_IFR" offset="0x38" rw="RW" size="4">
          <bitfield caption="Width of Instruction Code, Address, Option Code and Data" mask="0x00000007" name="WIDTH" values="QSPI_IFR__WIDTH"/>
          <bitfield caption="Instruction Enable" mask="0x00000010" name="INSTEN"/>
          <bitfield caption="Address Enable" mask="0x00000020" name="ADDREN"/>
          <bitfield caption="Option Enable" mask="0x00000040" name="OPTEN"/>
          <bitfield caption="Data Enable" mask="0x00000080" name="DATAEN"/>
          <bitfield caption="Option Code Length" mask="0x00000300" name="OPTL" values="QSPI_IFR__OPTL"/>
          <bitfield caption="Address Length" mask="0x00000400" name="ADDRL" values="QSPI_IFR__ADDRL"/>
          <bitfield caption="Data Transfer Type" mask="0x00003000" name="TFRTYP" values="QSPI_IFR__TFRTYP"/>
          <bitfield caption="Continuous Read Mode" mask="0x00004000" name="CRM" values="QSPI_IFR__CRM"/>
          <bitfield caption="Number Of Dummy Cycles" mask="0x001F0000" name="NBDUM"/>
        </register>
        <register caption="Scrambling Mode Register" name="QSPI_SMR" offset="0x40" rw="RW" size="4">
          <bitfield caption="Scrambling/Unscrambling Enable" mask="0x00000001" name="SCREN" values="QSPI_SMR__SCREN"/>
          <bitfield caption="Scrambling/Unscrambling Random Value Disable" mask="0x00000002" name="RVDIS"/>
        </register>
        <register caption="Scrambling Key Register" name="QSPI_SKR" offset="0x44" rw="W" size="4">
          <bitfield caption="User Scrambling Key" mask="0xFFFFFFFF" name="USRK"/>
        </register>
        <register caption="Write Protection Mode Register" name="QSPI_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="QSPI_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="QSPI_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x0000FF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="QSPI_MR__SMM">
        <value caption="The QSPI is in SPI mode." name="SPI" value="0"/>
        <value caption="The QSPI is in Serial Memory mode." name="MEMORY" value="1"/>
      </value-group>
      <value-group caption="" name="QSPI_MR__LLB">
        <value caption="Local loopback path disabled." name="DISABLED" value="0"/>
        <value caption="Local loopback path enabled." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="QSPI_MR__WDRBT">
        <value caption="No effect. In SPI mode, a transfer can be initiated whatever the state of the QSPI_RDR is." name="DISABLED" value="0"/>
        <value caption="In SPI mode, a transfer can start only if the QSPI_RDR is empty, i.e., does not contain any unread data. This mode prevents overrun error in reception." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="QSPI_MR__NBBITS">
        <value caption="8 bits for transfer" name="_8_BIT" value="0x0"/>
        <value caption="16 bits for transfer" name="_16_BIT" value="0x8"/>
      </value-group>
      <value-group caption="" name="QSPI_IFR__WIDTH">
        <value caption="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Single-bit SPI" name="SINGLE_BIT_SPI" value="0x0"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Dual SPI" name="DUAL_OUTPUT" value="0x1"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Quad SPI" name="QUAD_OUTPUT" value="0x2"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Dual SPI / Data: Dual SPI" name="DUAL_IO" value="0x3"/>
        <value caption="Instruction: Single-bit SPI / Address-Option: Quad SPI / Data: Quad SPI" name="QUAD_IO" value="0x4"/>
        <value caption="Instruction: Dual SPI / Address-Option: Dual SPI / Data: Dual SPI" name="DUAL_CMD" value="0x5"/>
        <value caption="Instruction: Quad SPI / Address-Option: Quad SPI / Data: Quad SPI" name="QUAD_CMD" value="0x6"/>
      </value-group>
