Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/4.0.41/samv71b/atdf/ATSAMV71N20B.atdf
      <value-group caption="" name="UART_MR__CHMODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="Automatic echo" name="AUTOMATIC" value="0x1"/>
        <value caption="Local loopback" name="LOCAL_LOOPBACK" value="0x2"/>
        <value caption="Remote loopback" name="REMOTE_LOOPBACK" value="0x3"/>
      </value-group>
      <value-group caption="" name="UART_CMPR__CMPMODE">
        <value caption="Any character is received and comparison function drives CMP flag." name="FLAG_ONLY" value="0"/>
        <value caption="Comparison condition must be met to start reception." name="START_CONDITION" value="1"/>
      </value-group>
      <value-group caption="" name="UART_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0x554152"/>
      </value-group>
    </module>
    <module name="USART" caption="Universal Synchronous Asynchronous Receiver Transmitter" id="6089" version="ZW">
      <register-group name="USART">
        <register caption="Control Register" name="US_CR" offset="0x0000" rw="W" size="4">
          <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
          <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
          <mode name="LIN" caption="LIN" qualifier="US_MR.USART_MODE"/>
          <bitfield modes="USART" caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield modes="USART" caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield modes="USART" caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield modes="USART" caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield modes="USART" caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield modes="USART" caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield modes="USART" caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
          <bitfield modes="USART" caption="Start Break" mask="0x00000200" name="STTBRK"/>
          <bitfield modes="USART" caption="Stop Break" mask="0x00000400" name="STPBRK"/>
          <bitfield modes="USART" caption="Clear TIMEOUT Flag and Start Timeout After Next Character Received" mask="0x00000800" name="STTTO"/>
          <bitfield modes="USART" caption="Send Address" mask="0x00001000" name="SENDA"/>
          <bitfield modes="USART" caption="Reset Iterations" mask="0x00002000" name="RSTIT"/>
          <bitfield modes="USART" caption="Reset Non Acknowledge" mask="0x00004000" name="RSTNACK"/>
          <bitfield modes="USART" caption="Start Timeout Immediately" mask="0x00008000" name="RETTO"/>
          <bitfield modes="USART" caption="Data Terminal Ready Enable" mask="0x00010000" name="DTREN"/>
          <bitfield modes="USART" caption="Data Terminal Ready Disable" mask="0x00020000" name="DTRDIS"/>
          <bitfield modes="USART" caption="Request to Send Enable" mask="0x00040000" name="RTSEN"/>
          <bitfield modes="USART" caption="Request to Send Disable" mask="0x00080000" name="RTSDIS"/>
          <bitfield modes="LIN" caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield modes="LIN" caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield modes="LIN" caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield modes="LIN" caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield modes="LIN" caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield modes="LIN" caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield modes="LIN" caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
          <bitfield modes="LIN" caption="Abort LIN Transmission" mask="0x00100000" name="LINABT"/>
          <bitfield modes="LIN" caption="Send LIN Wakeup Signal" mask="0x00200000" name="LINWKUP"/>
          <bitfield modes="SPI" caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield modes="SPI" caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield modes="SPI" caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield modes="SPI" caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield modes="SPI" caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield modes="SPI" caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield modes="SPI" caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
          <bitfield modes="SPI" caption="Force SPI Chip Select" mask="0x00040000" name="FCS"/>
          <bitfield modes="SPI" caption="Release SPI Chip Select" mask="0x00080000" name="RCS"/>
        </register>
        <register caption="Mode Register" name="US_MR" offset="0x0004" rw="RW" size="4">
          <mode name="USART" caption="USART" qualifier="US_MR.USART_MODE"/>
          <mode name="SPI" caption="SPI" qualifier="US_MR.USART_MODE"/>
          <bitfield modes="USART" caption="USART Mode of Operation" mask="0x0000000F" name="USART_MODE" values="US_MR__USART_MODE"/>
          <bitfield modes="USART" caption="Clock Selection" mask="0x00000030" name="USCLKS" values="US_MR__USCLKS"/>
          <bitfield modes="USART" caption="Character Length" mask="0x000000C0" name="CHRL" values="US_MR__CHRL"/>
          <bitfield modes="USART" caption="Synchronous Mode Select" mask="0x00000100" name="SYNC"/>
          <bitfield modes="USART" caption="Parity Type" mask="0x00000E00" name="PAR" values="US_MR__PAR"/>
          <bitfield modes="USART" caption="Number of Stop Bits" mask="0x00003000" name="NBSTOP" values="US_MR__NBSTOP"/>
          <bitfield modes="USART" caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="US_MR__CHMODE"/>
          <bitfield modes="USART" caption="Bit Order" mask="0x00010000" name="MSBF"/>
          <bitfield modes="USART" caption="9-bit Character Length" mask="0x00020000" name="MODE9"/>
          <bitfield modes="USART" caption="Clock Output Select" mask="0x00040000" name="CLKO"/>
          <bitfield modes="USART" caption="Oversampling Mode" mask="0x00080000" name="OVER"/>
          <bitfield modes="USART" caption="Inhibit Non Acknowledge" mask="0x00100000" name="INACK"/>
          <bitfield modes="USART" caption="Disable Successive NACK" mask="0x00200000" name="DSNACK"/>
          <bitfield modes="USART" caption="Variable Synchronization of Command/Data Sync Start Frame Delimiter" mask="0x00400000" name="VAR_SYNC"/>
          <bitfield modes="USART" caption="Inverted Data" mask="0x00800000" name="INVDATA"/>
          <bitfield modes="USART" caption="Maximum Number of Automatic Iteration" mask="0x07000000" name="MAX_ITERATION"/>
          <bitfield modes="USART" caption="Receive Line Filter" mask="0x10000000" name="FILTER"/>
          <bitfield modes="USART" caption="Manchester Encoder/Decoder Enable" mask="0x20000000" name="MAN"/>
          <bitfield modes="USART" caption="Manchester Synchronization Mode" mask="0x40000000" name="MODSYNC"/>
          <bitfield modes="USART" caption="Start Frame Delimiter Selector" mask="0x80000000" name="ONEBIT"/>
          <bitfield modes="SPI" caption="USART Mode of Operation" mask="0x0000000F" name="USART_MODE" values="US_MR__USART_MODE"/>
          <bitfield modes="SPI" caption="Clock Selection" mask="0x00000030" name="USCLKS" values="US_MR__USCLKS"/>
          <bitfield modes="SPI" caption="Character Length" mask="0x000000C0" name="CHRL" values="US_MR__CHRL"/>
          <bitfield modes="SPI" caption="Clock Output Select" mask="0x00040000" name="CLKO"/>
          <bitfield modes="SPI" caption="SPI Clock Phase" mask="0x00000100" name="CPHA"/>
          <bitfield modes="SPI" caption="SPI Clock Polarity" mask="0x00010000" name="CPOL"/>
          <bitfield modes="SPI" caption="Wait Read Data Before Transfer" mask="0x00100000" name="WRDBT"/>
        </register>
